# Select row

In [2]:
import pandas as pd

In [3]:
friend_list = [
                ['name',['John', 'Jenny', 'Nate']],
                ['age',[20,30,30]],
                ['job',['student','developer','teacher']]
]
df = pd.DataFrame.from_items(friend_list)

/Users/shinchan-yeop/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:6: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.

In [4]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## using index

In [6]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [7]:
df.loc[[0,2]]

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [8]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## using column value

In [9]:
df_filtered = df[df.age > 25]

In [10]:
df_filtered

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [11]:
df_filtered = df.query('age>25')

In [12]:
df_filtered

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [13]:
df_filtered = df[(df.age > 25) & (df.name == 'Nate')]

In [14]:
df_filtered

   name  age      job
2  Nate   30  teacher

In [17]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

# Column filtering

## by indexing

In [18]:
friend_list = [['John',20,'student'],['Jenny',30,'developer'],['Nate',30,'teacher']]
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [19]:
df.iloc[:, 0:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  30

In [20]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

## by column name

In [23]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names = ['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [24]:
df_filtered = df[['name', 'age']]
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [25]:
df.filter(items=['age','job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [26]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [40]:
#select columns contatining 'a'
df.filter(like = 'a', axis = 1) #axis == 0 : row, axis == 1 : column

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [33]:
#select columns using regex
df.filter(regex='b$', axis = 1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

# Drop row

In [41]:
friend_dict_list = [{'age':20, 'job': 'student'},
                   {'age':30, 'job': 'developer'},
                   {'age':30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, index = ['John','Jenny','Nate'])

In [42]:
df.head()

       age        job
John    20    student
Jenny   30  developer
Nate    30    teacher

In [43]:
df.drop(['John','Nate'])

       age        job
Jenny   30  developer

it doesnt save in dataframe

In [44]:
df

       age        job
John    20    student
Jenny   30  developer
Nate    30    teacher

In [45]:
df = df.drop(['John', 'Nate'])

In [46]:
df

       age        job
Jenny   30  developer

it can be saved in dataframe

## drop by row index

In [47]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
                   {'name': 'Jenny', 'age': 30, 'job': 'developer'},
                   {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)

In [48]:
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [49]:
df = df.drop(df.index[[0,2]])

In [50]:
df

    name  age        job
1  Jenny   30  developer

## drop by column value

In [52]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
                   {'name': 'Jenny', 'age': 30, 'job': 'developer'},
                   {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [53]:
df = df[df.age != 30]

In [54]:
df

   name  age      job
0  Jone   20  student

# Drop column

In [55]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
                   {'name': 'Jenny', 'age': 30, 'job': 'developer'},
                   {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [56]:
df = df.drop('age', axis = 1)

In [57]:
df

    name        job
0   Jone    student
1  Jenny  developer
2   Nate    teacher

## add or change column

In [58]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
                   {'name': 'Jenny', 'age': 30, 'job': 'developer'},
                   {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [59]:
df['salary'] = 0

In [60]:
df

    name  age        job  salary
0   Jone   20    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

In [62]:
friend_dict_list = [{'name': 'Jone', 'age': 15, 'job': 'student'},
                   {'name': 'Jenny', 'age': 30, 'job': 'developer'},
                   {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)
df

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Nate   30    teacher

using numpy

In [72]:
import numpy as np
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no')

In [73]:
df

    name  age        job salary
0   Jone   15    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [79]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
                   {'name': 'Jenny', 'midterm': 85, 'final': 80},
                   {'name': 'Nate', 'midterm': 10, 'final': 30}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

add two column values

In [80]:
df['total'] = df['midterm']+df['final']

In [81]:
df

    name  midterm  final  total
0   John       95     85    180
1  Jenny       85     80    165
2   Nate       10     30     40

In [82]:
df['average'] = df['total'] / 2

In [83]:
df

    name  midterm  final  total  average
0   John       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       10     30     40     20.0

In [84]:
grades = []

for row in df['average'] :
    if row >= 90 :
        grades.append('A')
    elif row >= 80 :
        grades.append('B')
    elif row >= 70 :
        grades.append('C')
    else :
        grades.append('F')
        
df['grades'] = grades

In [85]:
df

    name  midterm  final  total  average grades
0   John       95     85    180     90.0      A
1  Jenny       85     80    165     82.5      B
2   Nate       10     30     40     20.0      F

## using "apply" function

apply : can change column value neatly

In [86]:
def pass_or_fail(row) :
    print(row)
    if row != "F" :
        return 'Pass'
    else :
        return 'Fail'

In [87]:
df.grades = df.grades.apply(pass_or_fail)

A
B
F

In [88]:
df

    name  midterm  final  total  average grades
0   John       95     85    180     90.0   Pass
1  Jenny       85     80    165     82.5   Pass
2   Nate       10     30     40     20.0   Fail

In [89]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
            {'yyyy-mm-dd': '2002-09-24'},
            {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [90]:
def extract_year(row) :
    return row.split('-')[0]

In [91]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [92]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [93]:
def extract_year(year, current_year) :
    return current_year - int(year)

In [100]:
df['age'] = df['year'].apply(extract_year,current_year = 2018)
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   18
1  2002-09-24  2002   16
2  2005-12-20  2005   13

### send several "parameters" to apply function

In [101]:
def get_introduce(age, prefix, suffix) :
    return prefix + str(age) + suffix

In [104]:
df['introduce'] = df['age'].apply(get_introduce, prefix = "I am ", suffix = " years old")
df

   yyyy-mm-dd  year  age          introduce
0  2000-06-27  2000   18  I am 18 years old
1  2002-09-24  2002   16  I am 16 years old
2  2005-12-20  2005   13  I am 13 years old

### send several "columns" to apply function

In [105]:
def get_introduce2(row) :
    return "I was born in " + str(row.year) + " my age is " + str(row.age)

df.introduce = df.apply(get_introduce2, axis=1)

In [106]:
df

   yyyy-mm-dd  year  age                        introduce
0  2000-06-27  2000   18  I was born in 2000 my age is 18
1  2002-09-24  2002   16  I was born in 2002 my age is 16
2  2005-12-20  2005   13  I was born in 2005 my age is 13

## using "map" function

In [107]:
def extract_year(row) :
    return row.split('-')[0]

date_list = [{'yyyy-mm-dd': '2000-06-27'},
            {'yyyy-mm-dd': '2002-09-24'},
            {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [108]:
df['year'] = df['yyyy-mm-dd'].map(extract_year)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [109]:
job_list = [{'age': 20, 'job': 'student'},
           {'age': 30, 'job': 'developer'},
           {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   30    teacher

In [110]:
df.job = df.job.map({"student":1,"developer":2,"teacher":3})
df

   age  job
0   20    1
1   30    2
2   30    3

## using "applymap" function

it is useful to every dataframe's values changes at one time

In [111]:
x_y = [{'x':5.5, 'y':-5.6},
        {'x':-5.2, 'y':5.5},
          {'x':-1.6, 'y':-4.5}]
df = pd.DataFrame(x_y)
df

     x    y
0  5.5 -5.6
1 -5.2  5.5
2 -1.6 -4.5

In [112]:
df = df.applymap(np.around) #numpy around == round

In [113]:
df

     x    y
0  6.0 -6.0
1 -5.0  6.0
2 -2.0 -4.0

# Add Row to dataframe

In [114]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
                   {'name': 'Jenny', 'midterm': 85, 'final': 80},
                   {'name': 'Nate', 'midterm': 10, 'final': 30}]
df = pd.DataFrame(friend_dict_list, columns = ['name','midterm','final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

In [118]:
df2 = pd.DataFrame([['Ben',50,50]], columns = ['name','midterm','final'])

In [119]:
df2.head()

  name  midterm  final
0  Ben       50     50

In [122]:
df.append(df2, ignore_index=True)

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30
3    Ben       50     50